Streamline README
